<template>
    <div class="md-body">
      <h1>В этом приложении:</h1>
      <ul>
        <li>🔥 Composition API + Vue 3</li>
        <li>🔥 TypeScript + сервисы</li>
        <li>Работа с API по техлогии REST</li>
        <li>Хранение данных полученных от сервера</li>
        <li>Отправка запросов на апи через отдельные сервисы</li>
        <li>Полная настройка шаблона на Vue CLI + TypeScript</li>
        <li>Установка и настройка Vue-router для Vue.js 3 + TypeScript</li>
        <li>Настройка общего конфига для TypeScript</li>
      </ul>
      <h2>И мелочи:</h2>
      <ul>
        <li>
          Знакомство с сервисами и разделение логики и ui на отдельные файлы
        </li>
        <li>Интеграция TS в базовый шаблон vue cli</li>
        <li>Спиннер ui, который можно переиспользовать в любом проекте.</li>
      </ul>
  
      <p>
        Сделано на курсе
        <a href="https://tocode.ru/courses/vuejs-3-s-nulya-do-rezultata/"
          >Cделано на курсе "Vue.js 3 c нуля до результата"</a
        >
      </p>
    </div>
  </template>